### 학생성적 예측 데이터

In [67]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/X_train.csv", index_col = 'StudentID')
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/y_train.csv", index_col = 'StudentID')
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/X_test.csv", index_col = 'StudentID')


display(x_train.head())
display(y_train.head())

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,romantic,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2
StudentID,,,,,,,,,,,,,,,,,,,,,
1714,GP,F,18,U,GT3,T,4,3,other,other,...,no,4,3,3,1,1,3,0,14,13
1254,GP,F,17,U,GT3,T,4,3,health,other,...,yes,4,4,3,1,3,4,0,13,15
1639,GP,F,16,R,GT3,T,4,4,health,teacher,...,no,2,4,4,2,3,4,6,10,11
1118,GP,M,16,U,GT3,T,4,4,services,services,...,no,5,3,3,1,3,5,0,15,13
1499,GP,M,19,U,GT3,T,3,2,services,at_home,...,yes,4,5,4,1,1,4,0,5,0

           G3
StudentID
1714       14
1254       15
1639       11
1118       13
1499        0

In [68]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 678 entries, 1714 to 1394
Data columns (total 32 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      678 non-null    object
 1   sex         678 non-null    object
 2   age         678 non-null    int64
 3   address     678 non-null    object
 4   famsize     678 non-null    object
 5   Pstatus     678 non-null    object
 6   Medu        678 non-null    int64
 7   Fedu        678 non-null    int64
 8   Mjob        678 non-null    object
 9   Fjob        678 non-null    object
 10  reason      678 non-null    object
 11  guardian    678 non-null    object
 12  traveltime  678 non-null    int64
 13  studytime   678 non-null    int64
 14  failures    678 non-null    int64
 15  schoolsup   678 non-null    object
 16  famsup      678 non-null    object
 17  paid        678 non-null    object
 18  activities  678 non-null    object
 19  nursery     678 non-null    object
 20  higher      678 non-null    object
 21  internet    678 non-null    object
 22  romantic    678 non-null    object
 23  famrel      678 non-null    int64
 24  freetime    678 non-null    int64
 25  goout       678 non-null    int64
 26  Dalc        678 non-null    int64
 27  Walc        678 non-null    int64
 28  health      678 non-null    int64
 29  absences    678 non-null    int64
 30  G1          678 non-null    int64
 31  G2          678 non-null    int64
dtypes: int64(15), object(17)
memory usage: 174.8+ KB

In [69]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 366 entries, 1000 to 2037
Data columns (total 32 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      366 non-null    object
 1   sex         366 non-null    object
 2   age         366 non-null    int64
 3   address     366 non-null    object
 4   famsize     366 non-null    object
 5   Pstatus     366 non-null    object
 6   Medu        366 non-null    int64
 7   Fedu        366 non-null    int64
 8   Mjob        366 non-null    object
 9   Fjob        366 non-null    object
 10  reason      366 non-null    object
 11  guardian    366 non-null    object
 12  traveltime  366 non-null    int64
 13  studytime   366 non-null    int64
 14  failures    366 non-null    int64
 15  schoolsup   366 non-null    object
 16  famsup      366 non-null    object
 17  paid        366 non-null    object
 18  activities  366 non-null    object
 19  nursery     366 non-null    object
 20  higher      366 non-null    object
 21  internet    366 non-null    object
 22  romantic    366 non-null    object
 23  famrel      366 non-null    int64
 24  freetime    366 non-null    int64
 25  goout       366 non-null    int64
 26  Dalc        366 non-null    int64
 27  Walc        366 non-null    int64
 28  health      366 non-null    int64
 29  absences    366 non-null    int64
 30  G1          366 non-null    int64
 31  G2          366 non-null    int64
dtypes: int64(15), object(17)
memory usage: 94.4+ KB

In [70]:
x_train.isnull().sum()

school        0
sex           0
age           0
address       0
famsize       0
Pstatus       0
Medu          0
Fedu          0
Mjob          0
Fjob          0
reason        0
guardian      0
traveltime    0
studytime     0
failures      0
schoolsup     0
famsup        0
paid          0
activities    0
nursery       0
higher        0
internet      0
romantic      0
famrel        0
freetime      0
goout         0
Dalc          0
Walc          0
health        0
absences      0
G1            0
G2            0
dtype: int64

In [71]:
x_test.isnull().sum()

school        0
sex           0
age           0
address       0
famsize       0
Pstatus       0
Medu          0
Fedu          0
Mjob          0
Fjob          0
reason        0
guardian      0
traveltime    0
studytime     0
failures      0
schoolsup     0
famsup        0
paid          0
activities    0
nursery       0
higher        0
internet      0
romantic      0
famrel        0
freetime      0
goout         0
Dalc          0
Walc          0
health        0
absences      0
G1            0
G2            0
dtype: int64

In [72]:
from sklearn.preprocessing import LabelEncoder
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import r2_score, mean_squared_error
from sklearn.preprocessing import MinMaxScaler
from sklearn.ensemble import RandomForestClassifier
from xgboost import XGBClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import roc_auc_score
from sklearn.model_selection import cross_val_score, GridSearchCV

In [73]:
# 인코딩 할 칼럼만 따로 만들어주기 (x_train)
x_train_encoding = x_train[['school','sex','address','famsize','Pstatus','Mjob','Fjob','reason','guardian','schoolsup','famsup','paid','activities','nursery'
                           ,'higher','internet','romantic']]
x_train_encoding.head()

,school,sex,address,famsize,Pstatus,Mjob,Fjob,reason,guardian,schoolsup,famsup,paid,activities,nursery,higher,internet,romantic
StudentID,,,,,,,,,,,,,,,,,
1714,GP,F,U,GT3,T,other,other,reputation,father,no,yes,yes,no,yes,yes,yes,no
1254,GP,F,U,GT3,T,health,other,reputation,mother,no,yes,yes,yes,yes,yes,yes,yes
1639,GP,F,R,GT3,T,health,teacher,other,mother,no,yes,no,yes,yes,yes,no,no
1118,GP,M,U,GT3,T,services,services,course,mother,no,yes,no,yes,yes,yes,yes,no
1499,GP,M,U,GT3,T,services,at_home,home,mother,no,yes,no,no,yes,no,yes,yes

In [74]:
# 인코딩 할 칼럼만 따로 만들어주기 (x_test)
x_test_encoding = x_test[['school','sex','address','famsize','Pstatus','Mjob','Fjob','reason','guardian','schoolsup','famsup','paid','activities','nursery'
                           ,'higher','internet','romantic']]
x_test_encoding.head()

,school,sex,address,famsize,Pstatus,Mjob,Fjob,reason,guardian,schoolsup,famsup,paid,activities,nursery,higher,internet,romantic
StudentID,,,,,,,,,,,,,,,,,
1000,GP,F,U,GT3,T,services,other,course,mother,no,yes,no,no,yes,yes,yes,no
1008,GP,M,U,GT3,T,other,services,course,other,no,no,no,no,no,yes,yes,no
1013,GP,F,U,GT3,T,services,services,reputation,mother,no,yes,yes,yes,yes,yes,yes,no
1014,GP,F,U,GT3,T,services,other,course,mother,yes,yes,yes,no,yes,yes,yes,no
1017,GP,F,U,LE3,A,other,other,home,mother,yes,no,no,yes,yes,yes,yes,yes

In [75]:
temp1 = pd.concat([x_train_encoding,x_test_encoding], axis=0)
temp1.head()

,school,sex,address,famsize,Pstatus,Mjob,Fjob,reason,guardian,schoolsup,famsup,paid,activities,nursery,higher,internet,romantic
StudentID,,,,,,,,,,,,,,,,,
1714,GP,F,U,GT3,T,other,other,reputation,father,no,yes,yes,no,yes,yes,yes,no
1254,GP,F,U,GT3,T,health,other,reputation,mother,no,yes,yes,yes,yes,yes,yes,yes
1639,GP,F,R,GT3,T,health,teacher,other,mother,no,yes,no,yes,yes,yes,no,no
1118,GP,M,U,GT3,T,services,services,course,mother,no,yes,no,yes,yes,yes,yes,no
1499,GP,M,U,GT3,T,services,at_home,home,mother,no,yes,no,no,yes,no,yes,yes

In [76]:
x_train_encoding.shape[0]

678

In [77]:
x_test_encoding.shape[0]

366

In [78]:
temp1_encoding = pd.get_dummies(temp1)
temp1_encoding

,school_GP,school_MS,sex_F,sex_M,address_R,address_U,famsize_GT3,famsize_LE3,Pstatus_A,Pstatus_T,...,activities_no,activities_yes,nursery_no,nursery_yes,higher_no,higher_yes,internet_no,internet_yes,romantic_no,romantic_yes
StudentID,,,,,,,,,,,,,,,,,,,,,
1714,1,0,1,0,0,1,1,0,0,1,...,1,0,0,1,0,1,0,1,1,0
1254,1,0,1,0,0,1,1,0,0,1,...,0,1,0,1,0,1,0,1,0,1
1639,1,0,1,0,1,0,1,0,0,1,...,0,1,0,1,0,1,1,0,1,0
1118,1,0,0,1,0,1,1,0,0,1,...,0,1,0,1,0,1,0,1,1,0
1499,1,0,0,1,0,1,1,0,0,1,...,1,0,0,1,1,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2032,1,0,1,0,1,0,0,1,0,1,...,1,0,1,0,0,1,0,1,1,0
2034,1,0,0,1,0,1,1,0,0,1,...,0,1,0,1,0,1,0,1,0,1
2035,1,0,1,0,0,1,1,0,0,1,...,1,0,0,1,0,1,0,1,1,0
2036,0,1,1,0,0,1,1,0,0,1,...,0,1,0,1,0,1,0,1,1,0
2037,0,1,0,1,0,1,1,0,0,1,...,0,1,1,0,0,1,0,1,1,0

In [79]:
x_train_encoding=temp1_encoding.iloc[:678]
x_test_encoding=temp1_encoding.iloc[678:]
x_train_encoding.shape, x_test_encoding.shape

((678, 43), (366, 43))

In [80]:
x_test_encoding

,school_GP,school_MS,sex_F,sex_M,address_R,address_U,famsize_GT3,famsize_LE3,Pstatus_A,Pstatus_T,...,activities_no,activities_yes,nursery_no,nursery_yes,higher_no,higher_yes,internet_no,internet_yes,romantic_no,romantic_yes
StudentID,,,,,,,,,,,,,,,,,,,,,
1000,1,0,1,0,0,1,1,0,0,1,...,1,0,0,1,0,1,0,1,1,0
1008,1,0,0,1,0,1,1,0,0,1,...,1,0,1,0,0,1,0,1,1,0
1013,1,0,1,0,0,1,1,0,0,1,...,0,1,0,1,0,1,0,1,1,0
1014,1,0,1,0,0,1,1,0,0,1,...,1,0,0,1,0,1,0,1,1,0
1017,1,0,1,0,0,1,0,1,1,0,...,0,1,0,1,0,1,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2032,1,0,1,0,1,0,0,1,0,1,...,1,0,1,0,0,1,0,1,1,0
2034,1,0,0,1,0,1,1,0,0,1,...,0,1,0,1,0,1,0,1,0,1
2035,1,0,1,0,0,1,1,0,0,1,...,1,0,0,1,0,1,0,1,1,0
2036,0,1,1,0,0,1,1,0,0,1,...,0,1,0,1,0,1,0,1,1,0
2037,0,1,0,1,0,1,1,0,0,1,...,0,1,1,0,0,1,0,1,1,0

In [81]:
x_train.drop(['school','sex','address','famsize','Pstatus','Mjob','Fjob','reason','guardian','schoolsup','famsup','paid','activities','nursery'
                           ,'higher','internet','romantic'], axis=1, inplace=True)

In [82]:
x_test.drop(['school','sex','address','famsize','Pstatus','Mjob','Fjob','reason','guardian','schoolsup','famsup','paid','activities','nursery'
                           ,'higher','internet','romantic'], axis=1, inplace=True)

In [83]:
x_train = pd.concat([x_train,x_train_encoding], axis=1)
x_train

,age,Medu,Fedu,traveltime,studytime,failures,famrel,freetime,goout,Dalc,...,activities_no,activities_yes,nursery_no,nursery_yes,higher_no,higher_yes,internet_no,internet_yes,romantic_no,romantic_yes
StudentID,,,,,,,,,,,,,,,,,,,,,
1714,18,4,3,1,4,0,4,3,3,1,...,1,0,0,1,0,1,0,1,1,0
1254,17,4,3,1,3,0,4,4,3,1,...,0,1,0,1,0,1,0,1,0,1
1639,16,4,4,1,2,0,2,4,4,2,...,0,1,0,1,0,1,1,0,1,0
1118,16,4,4,1,3,0,5,3,3,1,...,0,1,0,1,0,1,0,1,1,0
1499,19,3,2,1,1,3,4,5,4,1,...,1,0,0,1,1,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1074,15,4,4,1,1,0,5,3,3,1,...,0,1,1,0,0,1,0,1,1,0
1044,15,4,4,4,4,0,1,3,5,3,...,0,1,0,1,0,1,0,1,0,1
1078,17,4,4,2,1,0,4,1,1,2,...,1,0,0,1,0,1,0,1,1,0
1055,17,1,1,2,1,0,4,5,5,1,...,0,1,1,0,0,1,0,1,0,1
1394,17,3,2,1,4,0,5,2,2,1,...,0,1,1,0,0,1,0,1,1,0

In [84]:
x_test = pd.concat([x_test,x_test_encoding], axis=1)
x_test

,age,Medu,Fedu,traveltime,studytime,failures,famrel,freetime,goout,Dalc,...,activities_no,activities_yes,nursery_no,nursery_yes,higher_no,higher_yes,internet_no,internet_yes,romantic_no,romantic_yes
StudentID,,,,,,,,,,,,,,,,,,,,,
1000,16,4,2,1,2,0,4,2,3,1,...,1,0,0,1,0,1,0,1,1,0
1008,19,1,2,1,2,1,4,5,2,2,...,1,0,1,0,0,1,0,1,1,0
1013,16,4,4,1,3,0,3,2,3,1,...,0,1,0,1,0,1,0,1,1,0
1014,16,3,1,1,4,0,4,3,3,1,...,1,0,0,1,0,1,0,1,1,0
1017,15,3,4,1,2,0,5,3,2,1,...,0,1,0,1,0,1,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2032,15,3,1,2,4,0,4,4,2,2,...,1,0,1,0,0,1,0,1,1,0
2034,17,3,3,1,2,0,4,3,4,2,...,0,1,0,1,0,1,0,1,0,1
2035,16,2,3,1,2,0,2,3,1,1,...,1,0,0,1,0,1,0,1,1,0
2036,16,3,1,1,1,0,3,1,3,1,...,0,1,0,1,0,1,0,1,1,0
2037,18,4,4,1,2,0,3,2,4,1,...,0,1,1,0,0,1,0,1,1,0

In [97]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 678 entries, 1714 to 1394
Data columns (total 58 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   age                678 non-null    int64
 1   Medu               678 non-null    int64
 2   Fedu               678 non-null    int64
 3   traveltime         678 non-null    int64
 4   studytime          678 non-null    int64
 5   failures           678 non-null    int64
 6   famrel             678 non-null    int64
 7   freetime           678 non-null    int64
 8   goout              678 non-null    int64
 9   Dalc               678 non-null    int64
 10  Walc               678 non-null    int64
 11  health             678 non-null    int64
 12  absences           678 non-null    int64
 13  G1                 678 non-null    int64
 14  G2                 678 non-null    int64
 15  school_GP          678 non-null    uint8
 16  school_MS          678 non-null    uint8
 17  sex_F              678 non-null    uint8
 18  sex_M              678 non-null    uint8
 19  address_R          678 non-null    uint8
 20  address_U          678 non-null    uint8
 21  famsize_GT3        678 non-null    uint8
 22  famsize_LE3        678 non-null    uint8
 23  Pstatus_A          678 non-null    uint8
 24  Pstatus_T          678 non-null    uint8
 25  Mjob_at_home       678 non-null    uint8
 26  Mjob_health        678 non-null    uint8
 27  Mjob_other         678 non-null    uint8
 28  Mjob_services      678 non-null    uint8
 29  Mjob_teacher       678 non-null    uint8
 30  Fjob_at_home       678 non-null    uint8
 31  Fjob_health        678 non-null    uint8
 32  Fjob_other         678 non-null    uint8
 33  Fjob_services      678 non-null    uint8
 34  Fjob_teacher       678 non-null    uint8
 35  reason_course      678 non-null    uint8
 36  reason_home        678 non-null    uint8
 37  reason_other       678 non-null    uint8
 38  reason_reputation  678 non-null    uint8
 39  guardian_father    678 non-null    uint8
 40  guardian_mother    678 non-null    uint8
 41  guardian_other     678 non-null    uint8
 42  schoolsup_no       678 non-null    uint8
 43  schoolsup_yes      678 non-null    uint8
 44  famsup_no          678 non-null    uint8
 45  famsup_yes         678 non-null    uint8
 46  paid_no            678 non-null    uint8
 47  paid_yes           678 non-null    uint8
 48  activities_no      678 non-null    uint8
 49  activities_yes     678 non-null    uint8
 50  nursery_no         678 non-null    uint8
 51  nursery_yes        678 non-null    uint8
 52  higher_no          678 non-null    uint8
 53  higher_yes         678 non-null    uint8
 54  internet_no        678 non-null    uint8
 55  internet_yes       678 non-null    uint8
 56  romantic_no        678 non-null    uint8
 57  romantic_yes       678 non-null    uint8
dtypes: int64(15), uint8(43)
memory usage: 113.2 KB

In [98]:
x_train.head()

,age,Medu,Fedu,traveltime,studytime,failures,famrel,freetime,goout,Dalc,...,activities_no,activities_yes,nursery_no,nursery_yes,higher_no,higher_yes,internet_no,internet_yes,romantic_no,romantic_yes
StudentID,,,,,,,,,,,,,,,,,,,,,
1714,18,4,3,1,4,0,4,3,3,1,...,1,0,0,1,0,1,0,1,1,0
1254,17,4,3,1,3,0,4,4,3,1,...,0,1,0,1,0,1,0,1,0,1
1639,16,4,4,1,2,0,2,4,4,2,...,0,1,0,1,0,1,1,0,1,0
1118,16,4,4,1,3,0,5,3,3,1,...,0,1,0,1,0,1,0,1,1,0
1499,19,3,2,1,1,3,4,5,4,1,...,1,0,0,1,1,0,0,1,0,1

In [96]:
y_train.head()

           G3
StudentID
1714       14
1254       15
1639       11
1118       13
1499        0

In [86]:
import warnings
warnings.filterwarnings("ignore")

In [105]:
model = RandomForestRegressor()
result = cross_val_score(model, x_train, y_train)
result.mean()

0.8474348322874198

In [106]:
model.fit(x_train, y_train)

RandomForestRegressor()

In [107]:
pre = model.predict(x_test)
pre

array([16.37      , 10.87      , 14.09      ,  7.47      , 11.11      ,
       14.32      , 17.78      , 12.96      , 12.71      , 12.45      ,
       10.89      ,  9.24      , 12.01      , 16.17      , 12.37      ,
        0.        ,  9.95      , 15.23416667, 10.59      ,  3.1       ,
       12.06      ,  8.38      , 15.5225    , 11.27      ,  8.55      ,
       10.83      ,  8.39      , 10.11      , 10.85      , 12.66      ,
        8.1       , 12.77      , 14.82      , 14.89      ,  0.26      ,
        9.2       ,  3.27      , 16.9       , 11.21      ,  9.94      ,
       12.49      , 13.14      , 12.43      , 13.09      ,  0.16      ,
       10.68      , 14.56      ,  9.4       ,  8.59      , 11.38      ,
       10.38      ,  9.68      , 13.15      , 14.53      ,  9.34      ,
       10.21      , 15.035     ,  8.71      , 17.99      , 17.41      ,
        8.35      , 18.03      ,  9.87      , 14.66      ,  9.69      ,
       10.65      , 10.63      , 12.54      , 11.12      , 15.64      ,
        9.19      ,  9.57      ,  9.08      , 10.84      , 14.88      ,
       11.21      ,  0.12      , 10.55      ,  7.09      , 11.25      ,
       12.95      , 12.56      , 12.62      , 16.36      , 12.27      ,
        8.25      , 13.06      , 12.54      , 15.        , 13.28      ,
       14.33      , 12.13      ,  2.41      , 11.31      , 17.81      ,
       18.61      , 15.65      , 15.15      ,  5.74      ,  8.17      ,
       13.43      , 14.89      ,  7.25      , 16.036     , 12.62      ,
        9.77      , 13.02      , 12.76      , 13.61      , 10.1       ,
        8.46      , 15.315     , 12.32      , 11.36      , 10.09      ,
       14.52      , 14.38      , 13.26      , 13.4       , 10.52      ,
       12.28      , 15.235     , 10.69      ,  8.62      , 12.7       ,
       17.04      , 10.97      , 12.87      ,  9.5       , 15.82      ,
       14.68      , 11.9       , 10.48      ,  9.89      , 13.22      ,
       12.93      , 11.05      ,  8.5       , 15.3       , 11.23      ,
        9.89      , 11.01      , 15.44333333, 16.6       , 11.07      ,
       12.52      , 10.73      , 15.84166667, 17.86      ,  9.78      ,
       13.24      ,  8.27      , 11.82      , 12.54      ,  8.7       ,
        9.9       ,  9.22      , 11.18      , 17.49      , 11.34      ,
        6.98      , 15.65      ,  8.84      , 11.45      , 14.78      ,
       15.24      , 10.91      , 12.19      ,  0.41      , 10.46      ,
        9.35      ,  6.47      , 10.88      , 13.5       , 12.2       ,
        8.8       ,  9.56      , 12.09      , 10.68      , 10.17      ,
        6.36      , 15.3575    , 12.97      ,  9.17      ,  9.12      ,
       11.15      ,  7.94      , 11.95      ,  0.46      ,  6.89      ,
       11.03      , 14.4       , 13.37      , 15.64      , 10.82      ,
       10.28      , 14.66      ,  8.47      , 13.59      , 11.26      ,
       10.52      ,  8.66      , 12.45      , 10.1       , 10.84      ,
       12.72      , 10.11      , 10.37      , 12.74      , 17.85      ,
       12.95      ,  8.86      , 11.        , 11.64      , 11.31      ,
       10.93      ,  7.92      , 15.59      , 16.69333333, 10.33      ,
       16.78      , 12.29      ,  8.61      ,  8.75      ,  3.71      ,
       15.29      , 11.36      , 16.93      , 10.85      ,  9.45      ,
        8.25      , 13.33      , 18.55      ,  6.59      ,  8.39      ,
       12.36      , 11.49      ,  7.95      , 17.4       , 10.48      ,
       15.18      ,  6.09      ,  0.27      , 12.29      , 10.17      ,
       12.16      , 14.8       , 10.27      , 15.88      ,  7.21      ,
       10.6       , 15.06      , 17.4       , 12.51      , 12.25      ,
       11.35      ,  8.77      , 13.66      , 16.33      ,  6.8       ,
       18.01      , 17.46      , 15.33      , 10.39      ,  9.28      ,
       12.3       , 12.81      , 12.46      , 10.09      ,  5.89      ,
       15.97766667,  8.82      , 12.6       ,  8.5       ,  8.31      ,
        3.75      , 11.07      , 10.01      , 12.55      , 13.1       ,
       12.73      , 14.41      , 15.46416667,  7.07      , 10.99      ,
        0.36      , 15.35      ,  5.58      ,  7.86      , 14.33      ,
        0.28      ,  9.39      , 16.565     , 15.84      , 15.18      ,
       12.41      , 11.11      , 11.15      ,  8.45      ,  8.15      ,
       16.73      , 15.40416667, 10.85      , 11.59      , 15.48      ,
        5.71      , 12.53      , 17.61      , 10.87      ,  9.05      ,
       13.35      , 15.9       , 13.63      , 14.66      ,  5.77      ,
        9.41      , 13.75      ,  8.51      , 11.77      , 13.98      ,
       15.17      , 15.1       , 13.32      , 12.2       , 11.1       ,
       17.37      , 12.8       , 12.91      , 17.7       , 12.87      ,
       12.82      , 14.47      , 11.98      ,  7.73      , 10.27      ,
       10.01      ,  8.73      ,  6.13      ,  6.37      ,  9.72      ,
       13.2       ,  0.3       , 11.93      , 14.17      , 17.91      ,
       10.44      , 13.38      ,  0.        ,  6.79      ,  8.47      ,
       17.26      , 10.21      ,  8.49      , 10.23      , 11.1       ,
       12.17      , 10.01      , 11.54      , 13.21      , 10.48      ,
       10.82      , 15.99      , 12.17      , 16.02      ,  0.25      ,
       14.8       ])

In [108]:
dic = {'StudentID': x_test.index, 'score':pre}
submit = pd.DataFrame(dic)
submit

     StudentID  score
0         1000  16.37
1         1008  10.87
2         1013  14.09
3         1014   7.47
4         1017  11.11
..         ...    ...
361       2032  15.99
362       2034  12.17
363       2035  16.02
364       2036   0.25
365       2037  14.80

[366 rows x 2 columns]

### 중고차 가격 예측 데이터

In [110]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/X_train.csv", index_col='carID')
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/y_train.csv", index_col='carID')
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/X_test.csv", index_col='carID')


display(x_train.head())
display(y_train.head())

,brand,model,year,transmission,mileage,fuelType,tax,mpg,engineSize
carID,,,,,,,,,
13207,hyundi,Santa Fe,2019,Semi-Auto,4223,Diesel,145.0,39.8,2.2
17314,vauxhall,GTC,2015,Manual,47870,Diesel,125.0,60.1,2.0
12342,audi,RS4,2019,Automatic,5151,Petrol,145.0,29.1,2.9
13426,vw,Scirocco,2016,Automatic,20423,Diesel,30.0,57.6,2.0
16004,skoda,Scala,2020,Semi-Auto,3569,Petrol,145.0,47.1,1.0

       price
carID
13207  31995
17314   7700
12342  58990
13426  12999
16004  16990

In [111]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4960 entries, 13207 to 15135
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   brand         4960 non-null   object
 1   model         4960 non-null   object
 2   year          4960 non-null   int64
 3   transmission  4960 non-null   object
 4   mileage       4960 non-null   int64
 5   fuelType      4960 non-null   object
 6   tax           4960 non-null   float64
 7   mpg           4960 non-null   float64
 8   engineSize    4960 non-null   float64
dtypes: float64(3), int64(2), object(4)
memory usage: 387.5+ KB

In [112]:
x_train.isnull().sum()

brand           0
model           0
year            0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [113]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2672 entries, 12000 to 19631
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   brand         2672 non-null   object
 1   model         2672 non-null   object
 2   year          2672 non-null   int64
 3   transmission  2672 non-null   object
 4   mileage       2672 non-null   int64
 5   fuelType      2672 non-null   object
 6   tax           2672 non-null   float64
 7   mpg           2672 non-null   float64
 8   engineSize    2672 non-null   float64
dtypes: float64(3), int64(2), object(4)
memory usage: 208.8+ KB

In [114]:
x_test.isnull().sum()

brand           0
model           0
year            0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [115]:
# object 형만 따로 만들기
# 이거 이해하기 쉽게 알려달라고 해야지

x_train_encoding = x_train[['brand','model','transmission','fuelType']]
x_test_encoding = x_test[['brand','model','transmission','fuelType']]

In [116]:
temp1 = pd.concat([x_train_encoding, x_test_encoding], axis=0)
temp1.head()

          brand      model transmission fuelType
carID
13207    hyundi   Santa Fe    Semi-Auto   Diesel
17314  vauxhall        GTC       Manual   Diesel
12342      audi        RS4    Automatic   Petrol
13426        vw   Scirocco    Automatic   Diesel
16004     skoda      Scala    Semi-Auto   Petrol

In [117]:
temp1.shape[0]

7632

In [118]:
# 원핫인코딩
temp1_encoding = pd.get_dummies(temp1)
temp1_encoding.head()

,brand_audi,brand_bmw,brand_ford,brand_hyundi,brand_merc,brand_skoda,brand_toyota,brand_vauxhall,brand_vw,model_ 6 Series,...,model_ i8,transmission_Automatic,transmission_Manual,transmission_Other,transmission_Semi-Auto,fuelType_Diesel,fuelType_Electric,fuelType_Hybrid,fuelType_Other,fuelType_Petrol
carID,,,,,,,,,,,,,,,,,,,,,
13207,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,1,1,0,0,0,0
17314,0,0,0,0,0,0,0,1,0,0,...,0,0,1,0,0,1,0,0,0,0
12342,1,0,0,0,0,0,0,0,0,0,...,0,1,0,0,0,0,0,0,0,1
13426,0,0,0,0,0,0,0,0,1,0,...,0,1,0,0,0,1,0,0,0,0
16004,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,1,0,0,0,0,1

In [120]:
#원핫인코딩한거 나눠주기
x_train_encoding = temp1_encoding.iloc[:4960]
x_test_encoding = temp1_encoding.iloc[4960:]
x_train_encoding.shape, x_test_encoding.shape

((4960, 108), (2672, 108))

In [121]:
#원핫인코딩한 칼럼 제외해주기
x_train=x_train.drop(['brand','model','transmission','fuelType'], axis=1)

In [122]:
x_test=x_test.drop(['brand','model','transmission','fuelType'], axis=1)

In [123]:
x_train.head()

       year  mileage    tax   mpg  engineSize
carID
13207  2019     4223  145.0  39.8         2.2
17314  2015    47870  125.0  60.1         2.0
12342  2019     5151  145.0  29.1         2.9
13426  2016    20423   30.0  57.6         2.0
16004  2020     3569  145.0  47.1         1.0

In [124]:
#원핫인코딩 한 데이터랑 합쳐주기
x_train=pd.concat([x_train, x_train_encoding] ,axis=1)
x_test=pd.concat([x_test, x_test_encoding] ,axis=1)

In [125]:
x_train.head()

,year,mileage,tax,mpg,engineSize,brand_audi,brand_bmw,brand_ford,brand_hyundi,brand_merc,...,model_ i8,transmission_Automatic,transmission_Manual,transmission_Other,transmission_Semi-Auto,fuelType_Diesel,fuelType_Electric,fuelType_Hybrid,fuelType_Other,fuelType_Petrol
carID,,,,,,,,,,,,,,,,,,,,,
13207,2019,4223,145.0,39.8,2.2,0,0,0,1,0,...,0,0,0,0,1,1,0,0,0,0
17314,2015,47870,125.0,60.1,2.0,0,0,0,0,0,...,0,0,1,0,0,1,0,0,0,0
12342,2019,5151,145.0,29.1,2.9,1,0,0,0,0,...,0,1,0,0,0,0,0,0,0,1
13426,2016,20423,30.0,57.6,2.0,0,0,0,0,0,...,0,1,0,0,0,1,0,0,0,0
16004,2020,3569,145.0,47.1,1.0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,1

In [128]:
#이제 학습시키기
# 점수 뭐지...?????
model = RandomForestRegressor()
result = cross_val_score(model, x_train, y_train)
result.mean()

0.9581015177061406

In [129]:
model.fit(x_train, y_train)

RandomForestRegressor()

In [130]:
pre = model.predict(x_test)
pre

array([38751.21, 23851.04, 58121.57, ..., 20896.11, 20803.77,  3244.05])

In [131]:
y_train

       price
carID
13207  31995
17314   7700
12342  58990
13426  12999
16004  16990
...      ...
16898  17999
14416  28900
15453   8998
14666  23198
15135  14900

[4960 rows x 1 columns]

In [133]:
dic = {'carID':x_test.index, 'price':pre}
submit = pd.DataFrame(dic)
submit

      carID     price
0     12000  38751.21
1     12001  23851.04
2     12004  58121.57
3     12013  14908.44
4     12017  48915.67
...     ...       ...
2667  19618  44733.44
2668  19620  19062.33
2669  19626  20896.11
2670  19630  20803.77
2671  19631   3244.05

[2672 rows x 2 columns]

### 의료 비용 예측 데이터

In [198]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/x_train.csv", index_col='ID')
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/y_train.csv", index_col='ID')
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/x_test.csv", index_col='ID')


display(x_train.head())
display(y_train.head())

    age     sex     bmi  children smoker     region
ID
2    35  female  35.860         2     no  southeast
3    28  female  23.845         2     no  northwest
4    23  female  32.780         2    yes  southeast
6    52  female  25.300         2    yes  southeast
7    63    male  39.800         3     no  southwest

        charges
ID
2    5836.52040
3    4719.73655
4   36021.01120
6   24667.41900
7   15170.06900

In [199]:
x_train.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
dtype: int64

In [200]:
x_test.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
dtype: int64

In [201]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1070 entries, 2 to 1337
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1070 non-null   int64
 1   sex       1070 non-null   object
 2   bmi       1070 non-null   float64
 3   children  1070 non-null   int64
 4   smoker    1070 non-null   object
 5   region    1070 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 58.5+ KB

In [202]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 268 entries, 0 to 1334
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       268 non-null    int64
 1   sex       268 non-null    object
 2   bmi       268 non-null    float64
 3   children  268 non-null    int64
 4   smoker    268 non-null    object
 5   region    268 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 14.7+ KB

In [203]:
x_train_encoding = x_train[['sex','smoker','region']]
x_test_encoding = x_test[['sex','smoker','region']]

In [204]:
temp1 = pd.concat([x_train_encoding,x_test_encoding], axis=0)
temp1.head()

       sex smoker     region
ID
2   female     no  southeast
3   female     no  northwest
4   female    yes  southeast
6   female    yes  southeast
7     male     no  southwest

In [205]:
temp1.shape

(1338, 3)

In [206]:
temp1_encoding = pd.get_dummies(temp1)
temp1_encoding

,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
ID,,,,,,,,
2,1,0,1,0,0,0,1,0
3,1,0,1,0,0,1,0,0
4,1,0,0,1,0,0,1,0
6,1,0,0,1,0,0,1,0
7,0,1,1,0,0,0,0,1
...,...,...,...,...,...,...,...,...
1327,1,0,1,0,0,1,0,0
1328,1,0,1,0,0,1,0,0
1329,1,0,1,0,1,0,0,0
1331,1,0,0,1,0,1,0,0
1334,0,1,1,0,0,0,1,0

In [207]:
x_train_encoding = temp1_encoding.iloc[:1070]
x_test_encoding = temp1_encoding.iloc[1070:]
x_train_encoding.shape, x_test_encoding.shape

((1070, 8), (268, 8))

In [208]:
x_train = x_train.drop(['sex','smoker','region'], axis=1)
x_test = x_test.drop(['sex','smoker','region'], axis=1)

In [209]:
x_train

      age     bmi  children
ID
2      35  35.860         2
3      28  23.845         2
4      23  32.780         2
6      52  25.300         2
7      63  39.800         3
...   ...     ...       ...
1332   22  30.400         0
1333   50  31.825         0
1335   18  31.130         0
1336   56  26.695         1
1337   33  28.270         1

[1070 rows x 3 columns]

In [210]:
x_train.shape

(1070, 3)

In [211]:
x_train = pd.concat([x_train, x_train_encoding], axis=1)
#x_test = pd.concat([x_test, x_test_encoding], axis=0)

In [212]:
x_train

,age,bmi,children,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
ID,,,,,,,,,,,
2,35,35.860,2,1,0,1,0,0,0,1,0
3,28,23.845,2,1,0,1,0,0,1,0,0
4,23,32.780,2,1,0,0,1,0,0,1,0
6,52,25.300,2,1,0,0,1,0,0,1,0
7,63,39.800,3,0,1,1,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
1332,22,30.400,0,1,0,0,1,0,1,0,0
1333,50,31.825,0,0,1,0,1,1,0,0,0
1335,18,31.130,0,1,0,1,0,0,0,1,0
1336,56,26.695,1,0,1,0,1,0,1,0,0
1337,33,28.270,1,1,0,1,0,0,0,1,0

In [213]:
x_test = pd.concat([x_test, x_test_encoding], axis=1)

In [214]:
x_test

,age,bmi,children,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
ID,,,,,,,,,,,
0,34,42.900,1,0,1,1,0,0,0,0,1
1,18,28.215,0,1,0,1,0,1,0,0,0
5,43,29.900,1,1,0,1,0,0,0,0,1
21,28,33.820,0,0,1,1,0,0,1,0,0
26,56,41.910,0,1,0,1,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...
1327,58,28.215,0,1,0,1,0,0,1,0,0
1328,54,27.645,1,1,0,1,0,0,1,0,0
1329,20,30.590,0,1,0,1,0,1,0,0,0
1331,19,32.490,0,1,0,0,1,0,1,0,0
1334,62,38.830,0,0,1,1,0,0,0,1,0

In [217]:
model = RandomForestRegressor()
result = cross_val_score(model, x_train, y_train)
result.mean()

0.8312967369947989

In [218]:
model.fit(x_train, y_train)

RandomForestRegressor()

In [219]:
pre = model.predict(x_test)

In [220]:
pre

array([ 6018.294947  ,  3037.7785471 ,  7372.8881785 , 13875.6206067 ,
       13727.1229915 , 11732.5397494 ,  1614.9272546 ,  9182.5157405 ,
        9359.1185806 , 11903.7258294 , 43999.9261389 ,  6971.065187  ,
        6657.1014679 ,  4889.8138553 ,  9266.8066132 , 34336.8237054 ,
       16617.6079767 , 54322.0923891 ,  5449.7453538 ,  2430.6648038 ,
        5299.074053  , 41853.4580744 , 11126.65325   , 12551.6835044 ,
       20839.3144338 , 48859.4758029 , 11064.8618206 , 38607.5235325 ,
       17220.1969051 , 17759.0610887 ,  1822.2313275 , 11419.3643605 ,
       10981.8148309 ,  2592.3925828 ,  1991.58354883,  7545.5011192 ,
        7404.9777851 , 11272.190524  ,  3747.2774389 , 40204.1957655 ,
       14188.5986581 ,  8790.4289884 , 49860.6949891 ,  7009.0890975 ,
       18078.4631446 ,  2056.8983995 ,  5837.787446  , 10568.295685  ,
        6600.1688714 , 33873.865299  , 11669.996016  ,  8080.9881429 ,
        8916.5602724 ,  4562.6462805 , 33831.8129742 , 23854.8677225 ,
       40328.3930148 , 10211.0467699 , 40973.4856879 , 18695.8793052 ,
       14694.7953294 ,  8030.8012429 ,  9619.5663155 , 11177.171466  ,
        7833.8019848 , 10447.2770346 , 21674.1285625 ,  4165.040895  ,
        3124.3487315 ,  8387.4414014 , 29794.6020984 , 10997.9137112 ,
        3879.8782965 , 10540.0908116 ,  6008.1572005 ,  9103.871007  ,
        2828.416618  ,  3346.7500631 ,  5495.6591859 ,  3525.8594358 ,
       24444.855464  ,  5519.204488  ,  4692.8576544 , 11357.764517  ,
       15574.7088978 ,  7391.9906006 ,  6954.0200155 ,  4205.2070002 ,
        6397.0303813 , 47226.6683115 ,  1978.577066  , 15478.6283334 ,
        4186.3855929 , 17451.4784    , 23451.5482193 , 10482.1191554 ,
       12809.2235304 ,  6387.0474859 , 29020.9027895 , 11203.3608062 ,
        3520.9866933 ,  4879.30819842,  5348.4053364 ,  6437.171955  ,
        4860.9372549 , 47780.839897  , 11558.7410361 ,  4171.7273204 ,
        1295.4263215 , 12249.0558975 , 40802.1257371 , 38180.909934  ,
        5439.0580087 ,  6671.4771425 , 11529.3521939 ,  9359.713812  ,
       18636.4764344 ,  5632.05267   ,  4803.3181491 ,  4929.2846854 ,
       28374.2143745 , 26157.5280218 , 47056.7663504 , 18350.098721  ,
        8583.156679  ,  4576.8775564 , 13757.5027251 ,  3656.8157815 ,
       37798.7761286 , 22499.0608406 ,  9332.6112496 ,  1824.26768633,
        6216.5542808 , 17629.2092298 , 26955.8156611 , 34253.9083075 ,
       19835.7266505 , 13162.282888  , 11348.9167277 , 10972.3741542 ,
        5468.53797   ,  9727.8745658 ,  7196.886712  , 36365.8298739 ,
        4518.7679023 ,  2184.0865391 ,  6242.2452593 ,  8652.741644  ,
        2063.9902425 ,  6640.782549  ,  6586.8024265 , 21277.0182605 ,
       12168.1667423 ,  6445.9168305 , 14360.2148239 , 11874.6317128 ,
        4861.845686  ,  8236.9856055 , 14393.9323595 ,  7164.6576615 ,
       17117.5467209 ,  6744.4889595 , 11131.6708671 , 10927.9307325 ,
       42214.8394744 ,  6054.6124814 ,  9215.2338557 ,  4633.200528  ,
        1272.701476  , 11310.108083  ,  2984.574933  , 21792.2908429 ,
       13556.207537  ,  6201.8906808 ,  7742.3241546 , 37115.1189501 ,
        7332.5030584 ,  5920.3828393 ,  1713.7259735 ,  2427.70409292,
        5647.1028298 ,  3929.14781455, 16539.5149448 , 20455.7675445 ,
        5421.6340443 , 44836.2434338 ,  2975.3684069 ,  2225.3711595 ,
        7879.2608943 , 41951.7264274 , 35520.0432484 , 18308.9561175 ,
        8018.715471  , 20682.4494589 , 11559.0261189 , 13094.8967907 ,
        9837.3081496 , 10048.895946  , 12068.9724438 , 11296.5238519 ,
       20033.8358609 ,  9273.2189592 , 12993.1000153 , 54049.3082686 ,
       41940.6815889 , 10083.6968284 , 13149.1387629 ,  6598.1852055 ,
       10926.267912  ,  6453.082053  ,  6768.753025  ,  6879.444522  ,
       13803.120809  ,  3517.7139761 , 32745.4552765 ,  5398.4326485 ,
       18697.2340533 , 38252.2605252 ,  6537.8426238 ,  5947.9960001 ,
        6176.1945282 , 12382.1819696 ,  5808.1666635 , 36128.567275  ,
       26549.274916  ,  3146.7129438 , 14582.9589445 ,  7892.2214527 ,
       22994.5291015 ,  2020.72166875, 10541.5504596 ,  8227.6953493 ,
       12449.7028116 ,  3106.5390005 , 22814.6325417 ,  1710.8928315 ,
        7761.40245   ,  8035.9191542 , 11539.5937072 ,  4611.2148163 ,
       14050.3686378 ,  8683.7344995 ,  4782.0914823 , 13439.8946538 ,
        4892.2583914 , 12473.6408777 ,  3283.57073828,  4344.3740502 ,
        4590.8812437 , 11981.2186107 , 11351.1689134 , 15544.60085   ,
        6026.2389032 ,  7772.9562515 ,  2679.9114915 ,  9880.9990988 ,
       48065.0282025 ,  8129.4085967 , 17325.6209433 , 13317.3887812 ,
       11061.7300435 ,  6785.918331  ,  8720.2829468 , 12130.786912  ,
       12367.0154914 ,  2668.20109725, 35932.1582367 , 13151.0544476 ])

In [221]:
dic = {'ID':x_test.index, 'price':pre}
submit = pd.DataFrame(dic)
submit

       ID         price
0       0   6018.294947
1       1   3037.778547
2       5   7372.888179
3      21  13875.620607
4      26  13727.122992
..    ...           ...
263  1327  12130.786912
264  1328  12367.015491
265  1329   2668.201097
266  1331  35932.158237
267  1334  13151.054448

[268 rows x 2 columns]